// Copyright (c) 2009-2010 Satoshi Nakamoto
// Copyright (c) 2009-2016 The Bitcoin Core developers
// Distributed under the MIT software license, see the accompanying
// file COPYING or http://www.opensource.org/licenses/mit-license.php.

#include "txmempool.h"
#include <stdio.h>
#include "consensus/consensus.h"
#include "consensus/tx_verify.h"
#include "consensus/validation.h"
#include "validation.h"
#include "policy/policy.h"
#include "policy/fees.h"
#include "reverse_iterator.h"
#include "streams.h"
#include "timedata.h"
#include "util.h"
#include "utilmoneystr.h"
#include "utiltime.h"
#include "utilstrencodings.h"
#include "net.h"
#include "univalue.h"

//Portgas
#include "netmessagemaker.h"
#include "poker/poker.h"
#include <map>

#define LOG_PRINT(msg) printf("log msg is : [ %s ] file is : %s  function is %s line is : %d\n",(msg),__FILE__,__FUNCTION__,__LINE__);

CTxMemPoolEntry::CTxMemPoolEntry(const CTransactionRef& _tx, const CAmount& _nFee,
                                 int64_t _nTime, unsigned int _entryHeight,
                                 bool _spendsCoinbase, int64_t _sigOpsCost, LockPoints lp):
    tx(_tx), nFee(_nFee), nTime(_nTime), entryHeight(_entryHeight),
    spendsCoinbase(_spendsCoinbase), sigOpCost(_sigOpsCost), lockPoints(lp)
{
    nTxWeight = GetTransactionWeight(*tx);
    nUsageSize = RecursiveDynamicUsage(tx);

    nCountWithDescendants = 1;
    nSizeWithDescendants = GetTxSize();
    nModFeesWithDescendants = nFee;

    feeDelta = 0;


        // the mempool can be in an inconsistent state.  In this case, the set
        // of ancestors reachable via mapLinks will be the same as the set of
        // ancestors whose packages include this transaction, because when we
        // add a new transaction to the mempool in addUnchecked(), we assume it
        // has no children, and in the case of a reorg where that assumption is
        // false, the in-mempool children aren't linked to the in-block tx's
        // until UpdateTransactionsFromBlock() is called.
        // So if we're being called during a reorg, ie before
        // UpdateTransactionsFromBlock() has been called, then mapLinks[] will
        // differ from the set of mempool parents we'd calculate by searching,
        // and it's important that we use the mapLinks[] notion of ancestor
        // transactions as the set of things to update for removal.
        CalculateMemPoolAncestors(entry, setAncestors, nNoLimit, nNoLimit, nNoLimit, nNoLimit, dummy, false);
        // Note that UpdateAncestorsOf severs the child links that point to
        // removeIt in the entries for the parents of removeIt.
        UpdateAncestorsOf(false, removeIt, setAncestors);
    }
    // After updating all the ancestor sizes, we can now sever the link between each
    // transaction being removed and any mempool children (ie, update setMemPoolParents
    // for each direct child of a transaction being removed).
    for (txiter removeIt : entriesToRemove) {
        UpdateChildrenForRemoval(removeIt);
    }
}

void CTxMemPoolEntry::UpdateDescendantState(int64_t modifySize, CAmount modifyFee, int64_t modifyCount)
{
    nSizeWithDescendants += modifySize;
    assert(int64_t(nSizeWithDescendants) > 0);
    nModFeesWithDescendants += modifyFee;
    nCountWithDescendants += modifyCount;
    assert(int64_t(nCountWithDescendants) > 0);
}

void CTxMemPoolEntry::UpdateAncestorState(int64_t modifySize, CAmount modifyFee, int64_t modifyCount, int modifySigOps)
{
    nSizeWithAncestors += modifySize;
    assert(int64_t(nSizeWithAncestors) > 0);
    nModFeesWithAncestors += modifyFee;
    nCountWithAncestors += modifyCount;
    assert(int64_t(nCountWithAncestors) > 0);
    nSigOpCostWithAncestors += modifySigOps;
    assert(int(nSigOpCostWithAncestors) >= 0);
}

CTxMemPool::CTxMemPool(CBlockPolicyEstimator* estimator) :
    nTransactionsUpdated(0), minerPolicyEstimator(estimator)
{
    _clear(); //lock free clear

    // Sanity checks off by default for performance, because otherwise
    // accepting transactions becomes O(N^2) where N is the number
    // of transactions in the pool
    nCheckFrequency = 0;
}

bool CTxMemPool::isSpent(const COutPoint& outpoint)
{
    LOCK(cs);
    return mapNextTx.count(outpoint);
}

unsigned int CTxMemPool::GetTransactionsUpdated() const
{
    LOCK(cs);
    return nTransactionsUpdated;
}

void CTxMemPool::AddTransactionsUpdated(unsigned int n)
{
    LOCK(cs);
    nTransactionsUpdated += n;
}

// 	add   to  tmcg
std::map<std::string, std::string> gMapAddress;
std::vector< CTransaction> vTxIpVerify; //40
std::vector< CTransaction> vTxNewAddressVerify; //41
std::vector< CTransaction> vTxPublicAddressVerify; //42
std::vector< CTransaction> vTxPokerBalanceVerify; //43
std::vector< CTransaction> vTxPokerHandleVerify; //44
std::vector< CTransaction> vTxPokerDlogVerify; //45 // not use
std::vector< CTransaction> vTxPokerPubkeyVerify; //46
std::vector< CTransaction> vTxPokerSshVerify; //47
std::vector< CTransaction> vTxPokerShuffleVerify; //49
std::vector< CTransaction> vTxPokerHandleCardVerify; //51
std::vector< CTransaction> vTxPokerFlopCardVerify; //53
std::vector< CTransaction> vTxPokerOpenHandVerify; //55
std::vector< CTransaction> vTxDepositVerify; //70
std::vector< CTransaction> vTxBetVerify; //80
std::vector< MsgTimeOut > vMsgTimeOut;
std::vector< CTransaction> vTxTimeOut; //

std::vector< CTransaction > vTxMatchPlayer;

std::multimap<std::string, CTransaction> vTxBetPlayer;
std::map<std::string, CTransaction> vTxDepositPlayer;


void saveTxBet(std::string &ip,const CTransaction &tx)
{
	// if(!vTxBetVerify.empty())
	// {
		// const std::string preHash = vTxBetVerify.at(vTxBetVerify.size() - 1).GetHash().ToString();
		// const MsgNode &node = g_tmcg->RecvMsg[preHash];

		// if(node.NextIndex != g_tmcg->nodeIndexMap[ip])
		// {
			// std::cout << "无效交易 游戏结束  " << ip << " index : " << node.NextIndex << " map index : " << g_tmcg->nodeIndexMap[ip] << std::endl;
			// return ;
		// }
		// // int tempIndex = -1;
		// // int tempAmount = -1;
		// // pokerhistory(tempIndex,tempAmount);
	// }
	vTxBetVerify.push_back(tx);
	vTxBetPlayer.insert(std::make_pair(ip,tx));
	return ;
}

void saveTxDeposit(std::string &ip,const CTransaction &tx)
{
